src/cf/Catalogs/СостоянияЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СостоянияЗаказовПоставщикам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 - проектное решение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьСтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СостоянияЗаказовПоставщикам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Цвет = Новый ХранилищеЗначения(ОбъектКопирования.Цвет.Получить());
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитДопУпорядочивания = НовыйРеквизитДопУпорядочивания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРеквизитДопУпорядочивания()
	
	Если Ссылка = Справочники.СостоянияЗаказовПоставщикам.Завершен Тогда
		Возврат 99999; // Всегда последним.
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И РеквизитДопУпорядочивания <> 0 И РеквизитДопУпорядочивания <> 99999 Тогда
		Возврат РеквизитДопУпорядочивания;
	КонецЕсли;
	
	СтарыйРеквизитДопУпорядочивания = Неопределено;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СтарыйРеквизитДопУпорядочивания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "РеквизитДопУпорядочивания");
	КонецЕсли;
	
	Если РеквизитДопУпорядочивания = 99999 И СтарыйРеквизитДопУпорядочивания <> Неопределено Тогда
		Возврат СтарыйРеквизитДопУпорядочивания;
	КонецЕсли;
	
	Возврат НовыйМаксимальныйРеквизитДопУпорядочивания(СтарыйРеквизитДопУпорядочивания);
	
КонецФункции

Функция НовыйМаксимальныйРеквизитДопУпорядочивания(СтарыйРеквизитДопУпорядочивания)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияЗаказовПоставщикам.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	|ИЗ
	|	Справочник.СостоянияЗаказовПоставщикам КАК СостоянияЗаказовПоставщикам
	|ГДЕ
	|	СостоянияЗаказовПоставщикам.Ссылка <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПоставщикам.Завершен)
	|	И СостоянияЗаказовПоставщикам.Ссылка <> &СтарыйРеквизитДопУпорядочивания
	|	И СостоянияЗаказовПоставщикам.РеквизитДопУпорядочивания < (ВЫРАЗИТЬ(99998 КАК ЧИСЛО(5, 0)))
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания УБЫВ";
	
	Запрос.УстановитьПараметр("СтарыйРеквизитДопУпорядочивания", СтарыйРеквизитДопУпорядочивания);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НовыйМаксимальныйРеквизитДопУпорядочивания = 0;
	Если Выборка.Следующий() Тогда
		НовыйМаксимальныйРеквизитДопУпорядочивания = Выборка.РеквизитДопУпорядочивания;
	КонецЕсли;
	
	НовыйМаксимальныйРеквизитДопУпорядочивания = НовыйМаксимальныйРеквизитДопУпорядочивания + 1;
	
	Если НовыйМаксимальныйРеквизитДопУпорядочивания = 99999 Тогда
		НовыйМаксимальныйРеквизитДопУпорядочивания = 1;
	КонецЕсли;
	
	Возврат НовыйМаксимальныйРеквизитДопУпорядочивания;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
